#### Terraform Plan 📝
```

data.archive_file.lambda_zip: Reading...
random_password.valid_token: Refreshing state... [id=none]
data.archive_file.lambda_zip: Read complete after 0s [id=990ef3277199c3ccac0f552dc1fb9de8d61466ce]
data.aws_iam_role.lab_role: Reading...
data.aws_eks_cluster.cluster: Reading...
aws_ssm_parameter.valid_token_ssm: Refreshing state... [id=/ordering-system/apigateway/token]
aws_api_gateway_rest_api.api: Refreshing state... [id=60titvxjha]
data.aws_eks_cluster_auth.auth: Reading...
aws_s3_bucket.ordering_serverless_state: Refreshing state... [id=ordering-system-serverless-state]
data.aws_eks_cluster_auth.auth: Read complete after 0s [id=ordering-eks-cluster]
data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
aws_api_gateway_resource.proxy: Refreshing state... [id=goz1bp]
aws_lambda_function.authorizer: Refreshing state... [id=api-authorizer]
data.aws_eks_cluster.cluster: Read complete after 0s [id=ordering-eks-cluster]
data.kubernetes_service.app_loadbalancer_service: Reading...
aws_lambda_permission.apigw_authorizer_invoke: Refreshing state... [id=AllowAPIGatewayInvokeAuthorizer]
aws_api_gateway_authorizer.lambda_auth: Refreshing state... [id=3ilq8p]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-60titvxjha-goz1bp-ANY]
data.kubernetes_service.app_loadbalancer_service: Read complete after 1s [id=default/svc-app-loadbalancer]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api will be created
  + resource "aws_api_gateway_deployment" "api" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "us-east-1"
      + rest_api_id  = "60titvxjha"
    }

  # aws_api_gateway_integration.proxy will be created
  + resource "aws_api_gateway_integration" "proxy" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "ANY"
      + id                      = (known after apply)
      + integration_http_method = "ANY"
      + passthrough_behavior    = (known after apply)
      + region                  = "us-east-1"
      + resource_id             = "goz1bp"
      + rest_api_id             = "60titvxjha"
      + timeout_milliseconds    = 29000
      + type                    = "HTTP_PROXY"
      + uri                     = "https://a5e0d26c29cfd4d619aaa14bf8a8e97b-e2b02cd5358dd6c2.elb.us-east-1.amazonaws.com/{proxy}"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

*Pusher: @jharoldo, Action: `pull_request`*